config/ruby-config.org
TITLE: Ruby Configuration options
#+AUTHOR: Ari Turetzky
#+EMAIL: ari@turetzky.org
#+TAGS: emacs config ruby
#+PROPERTY: header-args:sh  :results silent :tangle no

* Ruby Mode!

first a little housekeeping for the linter
#+BEGIN_SRC elisp
;; -*- lexical-binding: t; -*-
;;; ruby-config --- Summary 
;;; Commentary:
;;; Code:
;;; coding: utf-8  -*- lexical-binding: t; -*-
#+END_SRC

** Set up some autoloads and associate files
#+BEGIN_SRC elisp
(autoload 'ruby-mode "ruby-mode" "Ruby editing mode." t)
(setq auto-mode-alist (cons '("\\.rb$" . ruby-mode)  auto-mode-alist))
(setq auto-mode-alist (cons '("\\.rhtml$" . web-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.erb$" . web-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.html.erb$" . web-mode) auto-mode-alist))
(add-to-list 'auto-mode-alist '("\\.html?" . web-mode))

;; Tree-sitter Ruby mode for Emacs 31
;; Use ruby-ts-mode when available, fallback to ruby-mode
(when (fboundp 'ruby-ts-mode)
  (add-to-list 'auto-mode-alist '("\\.rb$" . ruby-ts-mode))
  (setq ruby-ts-mode-indent-offset 2))
#+END_SRC
** Ruby Tools
   convenience stuff, mostly string to symbol, single to double qouts
   and such
#+BEGIN_SRC elisp
     (use-package ruby-tools
       :ensure t
       :init
       (add-hook 'ruby-mode #'ruby-tools-mode)
       (add-hook 'ruby-ts-mode #'ruby-tools-mode)
       :diminish ruby-tools-mode)
    (use-package rubocopfmt
      :ensure t
      :hook
      (ruby-mode . rubocopfmt-mode)
      (ruby-ts-mode . rubocopfmt-mode)
     )
#+END_SRC
** Seeing Is Believing
   This is a wonderful pacakge.  [[https://github.com/JoshCheek/seeing_is_believing][Seeing is Believing]] uses xmpfilter to
evaluate ruby code and add comment with the output so you can see what
is going on while you write code.
#+BEGIN_SRC elisp
  (use-package seeing-is-believing
    :diminish seeing-is-believing
    :ensure t
    :config
    (setq seeing-is-believing-alignment 'chunk)
    (setq seeing-is-believing-max-length 150)
    (setq seeing-is-believing-max-results 15)
    :hook
    (ruby-mode . seeing-is-believing)
    (ruby-ts-mode . seeing-is-believing)
    )
#+END_SRC


** Ruby Mode Hook
#+BEGIN_SRC elisp
  (use-package rspec-mode
    :ensure t
    :config
    (setq rspec-use-spring-when-possible nil)
    (setq rspec-command-options "--format progress"))
    (add-hook 'after-init-hook  'inf-ruby-switch-setup)

    (require 'ruby-block)
    (require 'ruby-electric)
    
    ;; Common Ruby configuration function
    (defun setup-ruby-environment ()
      "Set up common Ruby environment settings."
      (set (make-local-variable 'indent-tabs-mode) 'nil)
      (set (make-local-variable 'tab-width) 2)
      (ruby-electric-mode t)
      (ruby-block-mode t)
      (local-set-key (kbd "<return>") 'newline-and-indent))
    
    ;; Hook for traditional ruby-mode
    (add-hook 'ruby-mode-hook #'setup-ruby-environment)
    
    ;; Hook for tree-sitter ruby-ts-mode
    (when (fboundp 'ruby-ts-mode)
      (add-hook 'ruby-ts-mode-hook #'setup-ruby-environment))
#+END_SRC

#+
** File associations

#+BEGIN_SRC elisp
#+END_SRC
** Set Up RBENV

   #+BEGIN_SRC elisp
          (use-package rbenv
            :ensure t
            :init
            (setq rbenv-show-active-ruby-in-modeline nil)
            :config
            (setq rbenv-installation-dir "/opt/homebrew/Cellar/rbenv/1.2.0")
            (setq rbenv-executable "/opt/homebrew/bin/rbenv")
            (global-rbenv-mode t))

   #+END_SRC
** Key-bindings some still used and some more ac config
damn this is a mess
#+BEGIN_SRC elisp

  (use-package autotest
    :ensure t
    )
#+END_SRC
** hideshow for folding
#+BEGIN_SRC elisp
  ;; Common hideshow setup for Ruby modes
  (defun setup-ruby-hideshow ()
    "Set up hideshow for Ruby modes."
    (hs-minor-mode))
  
  ;; Hook for traditional ruby-mode
  (add-hook 'ruby-mode-hook #'setup-ruby-hideshow)
  
  ;; Hook for tree-sitter ruby-ts-mode
  (when (fboundp 'ruby-ts-mode)
    (add-hook 'ruby-ts-mode-hook #'setup-ruby-hideshow))

  (eval-after-load "hideshow"
    '(add-to-list 'hs-special-modes-alist
      `(ruby-mode
        ,(rx (or "def" "class" "module" "do" "{" "[")) ; Block start
        ,(rx (or "}" "]" "end"))                       ; Block end
        ,(rx (or "#" "=begin"))                        ; Comment start
        ruby-forward-sexp nil)))
  
  ;; Add tree-sitter mode to hideshow if available
  (when (fboundp 'ruby-ts-mode)
    (eval-after-load "hideshow"
      '(add-to-list 'hs-special-modes-alist
        `(ruby-ts-mode
          ,(rx (or "def" "class" "module" "do" "{" "[")) ; Block start
          ,(rx (or "}" "]" "end"))                       ; Block end
          ,(rx (or "#" "=begin"))                        ; Comment start
          ruby-forward-sexp nil))))

  ;; (global-set-key (kbd "C-c h") 'hs-hide-block)
  ;; (global-set-key (kbd "C-c s") 'hs-show-block)
#+END_SRC

** Tree-sitter Ruby Features
#+BEGIN_SRC elisp
;; Tree-sitter specific Ruby features for Emacs 31
(when (fboundp 'ruby-ts-mode)
  ;; Enhanced indentation for tree-sitter Ruby
  (setq ruby-ts-mode-indent-offset 2)
  
  ;; Better syntax highlighting with tree-sitter
  (add-hook 'ruby-ts-mode-hook
            (lambda ()
              ;; Enable tree-sitter-based syntax highlighting
              (when (fboundp 'tree-sitter-hl-mode)
                (tree-sitter-hl-mode))
              
              ;; Configure tree-sitter indentation
              (setq-local treesit-indent-offset 2)
              
              ;; Enable tree-sitter-based code folding
              (when (fboundp 'tree-sitter-fold-mode)
                (tree-sitter-fold-mode))))
  
  ;; Tree-sitter specific key bindings for Ruby
  ;; Defer key binding until the mode is loaded
  (add-hook 'ruby-ts-mode-hook
            (lambda ()
              (when (boundp 'ruby-ts-mode-map)
                (define-key ruby-ts-mode-map (kbd "C-c t") 'tree-sitter-hl-mode)
                (define-key ruby-ts-mode-map (kbd "C-c f") 'tree-sitter-fold-mode)))))
#+END_SRC

** Provide the new- config
#+BEGIN_SRC elisp
(provide 'ruby-config-new)
;;; ruby-config-new ends here
#+END_SRC
#+DESCRIPTION: Literate source for my Ruby configuration
#+PROPERTY: header-args:elisp :tangle ~/emacs/config/ruby-config-new.el
#+PROPERTY: header-args:ruby :tangle no
#+PROPERTY: header-args:shell :tangle no
#+OPTIONS:     num:t whn:nil toc:t todo:nil tasks:nil tags:nil
#+OPTIONS:     skip:nil author:nil email:nil creator:nil timestamp:nil
#+INFOJS_OPT:  view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
